Archiwum/openFoam_MIN/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.125 0.001 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.125 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0.125 0 0);
        value           uniform (0.125 0 0);
    }

    top
    {
        type            symmetryPlane;
    }

    bottom
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }

    cylinder
    {
        type            noSlip;
    }
}
