Archiwum/openFoam_MIN/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.12 -0.12 -0.005)
    ( 0.30 -0.12 -0.005)
    ( 0.30  0.12 -0.005)
    (-0.12  0.12 -0.005)
    (-0.12 -0.12  0.005)
    ( 0.30 -0.12  0.005)
    ( 0.30  0.12  0.005)
    (-0.12  0.12  0.005)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (140 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }

    back
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
