Archiwum/openFoam_MIN/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    cylinder
    {
        type searchableCylinder;
        point1 (0 0 -0.005);
        point2 (0 0  0.005);
        radius 0.006;
    }

    nearCylinder
    {
        type searchableBox;
        min (-0.030 -0.030 -0.005);
        max ( 0.030  0.030  0.005);
    }

    wakeBox
    {
        type searchableBox;
        min (-0.010 -0.030 -0.005);
        max ( 0.180  0.030  0.005);
    }
}

castellatedMeshControls
{
    maxLocalCells 200000;
    maxGlobalCells 1500000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;

    features
    (
    );

    refinementSurfaces
    {
        cylinder
        {
            level (3 3);
            patchInfo
            {
                type wall;
            }
        }
    }

    refinementRegions
    {
        nearCylinder
        {
            mode inside;
            levels ((1E15 2));
        }

        wakeBox
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    locationInMesh (-0.119 0 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 100;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.0;
    finalLayerThickness 0.0;
    minThickness 0.0;
    nGrow 0;
    featureAngle 180;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 0;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;
